ksf=14; mmf = [ ["#", "#", "#", "#"],
["!", "私　ゐ　学生　です。", "=", "!", "Я (є) студент/учень.", ";"],
["!", "私達　ゐ　ウクライナ人　です。", "=", "!", "Ми — українці.", ";"],
["!", "私　も　先生　です。", "=", "!", "Я теж вчитель.", ";"],
["あべさん", "!", "ゐ　今日　来ます。", "=", "!", "Абе-сан прийде сьогодні.", ";"],
["!", "山田さん　の　うち", "=", "!", "дім Ямади-сана", ";"],
["!", "私　の", "=", "!", "мій", ";"],
["!", "東京　の　大学", "=", "!", "університет в Токіо", ";"],
["!", "東京　の　大学　の　学生", "=", "!", "студент університету в Токіо", ";"],
["!", "うち　ゑ", "=", "!", "додому", ";"],
["!", "ここ　ゑ", "=", "!", "сюди", ";"],
["!", "東京　ゑ", "=", "!", "до Токіо, в Токіо [їхати, летіти тощо]", ";"],
["!", "学校　ゑ", "=", "!", "до школи, в школу [йти, їхати тощо]", ";"],
["!", "私　ゐ　学校　ゑ　行きます。", "=", "!", "Я піду до школи.", ";"],

["田中さん　ゐ", "!", "学生　です　か。", "=", "!", "Танака-сан — судентка?", ";"],
["山田さん", "!", "ゐ　来ます　か。", "=", "!", "Ямада-сан прийде?", ";"],
["私達　ゐ", "!", "先生　{じゃ　ありません。/　でゐ　ありません。}", "=", "!", "Ми не вчителі.", ";"],
["私", "!", "ゐ　明日　行きません。", "=", "!", "Я не піду завтра.", ";"],
["私達　ゐ", "!", "毎日　泳ぎません。", "=", "!", "Ми не плаваємо щодня.", ";"],

["!", "東京　の　大学　の　学生　です。", "=", "!", "[Я] студент університету в Токіо.", ";"],
["!", "帰りましょう。", "=", "!", "Ходімо додому.", ";"],
["!", "食べましょう。", "=", "!", "[Давай] поїмо.", ";"],
["!", "行きません　か。", "=", "!", "Чому б тобі/нам не піти? / Ти не йдеш?", ";"],
["私　ゐ　学生　です。", "!", "山田さん　ゐ？", "=", "!", "Я студент. А ви [Ямада-сан]?", ";"],
["!", "鈴木さん　です。", "=", "!", "[Це] Судзукі-сан.", ";"],
["!", "山田　です。", "=", "!", "Я Ямада.", ";"],






];