mms=[ [ ['#'], ['#'], ["#"], [0] ],
[ ['[','今日は'], ['こんにちは'], ["Доброго дня! Вітаю!"], [0] ],
[ ['私'], ['わたし'], ["я"], [0] ],
[ ['学生'], ['がくせい'], ["студент; слухач [курсів]; учень"], [0] ],
[ ['[','此方'], ['こちら'], ["<i>ввічливо, про людину:</i> це; ось; тут; поруч зі мною"], [0] ],
[ ['私達','私たち'], ['わたしたち'], ["ми"], [0] ],
[ ['卒業生'], ['そつぎょうせい'], ["випускник; людина, що закінчила навчання; людина із здобутою освітою"], [0] ],
[ ['友達','(','友だち'], ['ともだち'], ["друг; друзі"], [0] ],
[ ['[','家'], ['うち'], ["дім / сім'я"], [0] ],
[ ['東京'], ['とうきょう'], ["Токіо"], [0] ],
[ ['大学'], ['だいがく'], ["виш: університет; академія; коледж"], [0] ],
[ ['明日'], ['あした'], ["завтра; завтрашній день"], [0] ],////
[ ['行きます'], ['いきます'], ["йти; ходити / йти; їхати; піти; поїхати [звідкись, десь]"], [0] ],////
[ ['来ます'], ['きます'], ["приходити; приїжджати; прибувати [сюди, кудись]"], [0] ],////
[ ['泳ぎます'], ['およぎます'], ["плисти, плавати; купатись [у водоймі]"], [0] ],////
[ ['帰ります'], ['かえります'], ["вертатись / йти/їхати додому"], [0] ],////
[ ['食べます'], ['たべます'], ["їсти; харчуватись"], [0] ],////
[ ['今日'], ['きょう'], ["сьогодні; сьогоднішній день"], [0] ],////
[ ['毎日'], ['まいにち'], ["кожен день; щоденно; день за днем"], [0] ],
[ ['食堂'], ['しょくどう'], ["їдальня, буфет"], [0] ],
[ ['[',1,'此[れ]','(',1,'是(れ)',1,'之(れ)','維','惟'], ['これ'], ["<i>не ввічливо, про предмети:</i> це; ось"], [0] ],
[ ['先生'], ['せんせい'], ["<i>звернення:</i> вчитель; викладач; наставник; лікар"], [0] ],
[ ['学校','(','學校'], ['がっこう'], ["школа; училище; навчальний заклад"], [0] ],
[ ['ええ'], ['ええ'], ["так; правильно"], [0] ],
[ ['[','否'], ['いいえ'], ["ні"], [0] ],
[ ['も'], ['も'], ["теж, також"], [0] ],
[ ['一緒に'], ['いっしょに'], ["разом; спільно; <i>з кимось</i>"], [0] ],
[ ['[','此れから'], ['これから'], ["зараз, відтепер, надалі; скоро"], [0] ],
[ ['しばらくですね(え)。'], ['しばらくですね',1,'しばらくですねえ'], ["Давно [з вами/тобою] не бачились."], [0] ],
[ ['日本'], ['にほん','にっぽん'], ["Японія"], [0] ],
[ ['お元気ですか。'], ['おげんきですか'], ["Як твої/ваші справи? Як поживаєш? (<i>дослівно:</i> Ти добре почуваєшся?)"], [0] ],
[ ['お茶'], ['おちゃ'], ["[зелений] чай / перерва на чай / чайна церемонія"], [0] ],
[ ['[','初めまして','始めまして'], ['はじめまして'], ["Радий знайомству! Дуже приємно!"], [0] ],
[ ['まあまあ'], ['まあまあ'], ["непогано; так собі"], [0] ],
[ ['(ああ、)そうですか。'], ['そうですか',1,'ああ、そうですか'], ["Он (воно) як? / Справді? / Зрозуміло."], [0] ],
[ ['昨日'], ['きのう'], ["вчора"], [0] ],////
[ ['レストラン'], ['レストラン'], ["ресторан"], [0] ],
[ ['アメリカ料理'], ['アメリカりょうり'], ["американська кухня; американські страви"], [0] ],
[ ['飲みます'], ['のみます'], ["пити / пити [спиртне] / пити, приймати [ліки]"], [0] ],////
[ ['一昨日'], ['おととい'], ["позавчора"], [0] ],////
[ ['[','此処','(','此所','是','茲','爰'], ['ここ'], ["<i>не ввічливо, про предмети:</i> тут"], [0] ],////
[ ['フランス人'], ['フランスじん'], ["француз, француженка, французи"], [0] ],
[ ['料理'], ['りょうり'], ["приготування їжі; кулінарія / страва, страви; їжа; кухня"], [0] ],
[ ['買います'], ['かいます'], ["купувати | купити, придбати"], [0] ],////
[ ['晩御飯','晩ご飯'], ['ばんごはん'], ["вечеря"], [0] ],
[ ['消しゴム'], ['けしゴム'], ["гумка, ластик"], [0] ],
[ ['[','良く','(','善く','能く','好く','克く'], ['よく'], ["добре / часто"], [0] ], ////
[ ['喫茶店'], ['きっさてん'], ["кав'ярня, чайна, кафе"], [0] ],
[ ['と'], ['と'], ["<i>сполучник іменників:</i> і, й, та"], [0] ],
[ ['本'], ['ほん'], ["книга, книжка | книжки"], [0] ],
[ ['もう'], ['もう'], ["вже"], [0] ],////
[ ['鉛筆'], ['えんぴつ'], ["олівець"], [0] ],
[ ['日本人'], ['にほんじん','(','にっぽんじん)'], ["японець, японка, японці"], [0] ],
[ ['明後日'], ['あさって'], ["післязавтра"], [0] ],////
[ ['はい'], ['はい'], ["<i>ввічливо:</i> так; правильно / добре; слухаюсь / <i>не перекладається</i>"], [0] ],
[ ['ご飯','御飯'], ['ごはん'], ["їжа / [варений] рис"], [0] ],
[ ['時計'], ['とけい'], ["годинник"], [0] ],
[ ['[','皆'], ['みんな'], ["всі / все"], [0] ],////みな
[ ['どうぞ'], ['どうぞ'], ["будь ласка, прошу; заходьте, будь ласка; візьміть, будь ласка"], [0] ],
[ ['名前'], ['なまえ'], ["ім'я; прізвище / назва"], [0] ],
[ ['だから'], ['だから'], ["тому; через це; оскільки; в наслідок [цього]"], [0] ],
[ ['旅行'], ['りょこう'], ["подорож, поїздка, мандрівка"], [0] ],
[ ['ノック'], ['ノック'], ["стук [в двері]"], [0] ],////
[ ['音'], ['おと'], ["звук / шум"], [0] ],
[ ['[','左様なら'], ['さよなら','さようなら'], ["До побачення! Прощавай(те)!"], [0] ],
[ ['[','多分'], ['たぶん'], ["напевне; мабуть; ймовірно"], [0] ],
[ ['[','今晩は'], ['こんばんゐ'], ["Доброго вечора!"], [0] ],
[ ['ジュース'], ['ジュース'], ["сік / безалкогольний напій"], [0] ],
[ ['[','貴方','貴女','貴男'], ['あなた'], ["<i>до нижчого чи рівного:</i> ти"], [0] ],
[ ['一'], ['いち'], ["1"], [0] ],
[ ['[','お早う(ございます)'], ['おはよう','おはようございます'], ["Доброго ранку! <i>*довше — ввічливіше</i>"], [0] ],
[ ['二'], ['に'], ["2"], [0] ],
[ ['[','お休みなさい','御休みなさい'], ['おやすみなさい'], ["Надобраніч!"], [0] ],
[ ['三'], ['さん'], ["3"], [0] ],
[ ['[','御目出度う','御芽出度う'], ['おめでとう'], ["Вітаю!"], [0] ],////
[ ['四'], ['よん','し'], ["4"], [0] ],
[ ['[','皆で'], ['みんなで'], ["всі разом; всією групою, всією компанією"], [0] ],


[ ['いいですね。'], ['いいですね'], [""], [0] ],
[ ['あなたたち'], ['あなたたち'], [""], [0] ],
[ ['かれ'], ['かれ'], [""], [0] ],
//[ ['かれら'], ['かれら'], [""], [0] ],
[ ['かのじょ'], ['かのじょ'], [""], [0] ],
//[ ['かのじょら'], ['かのじょら'], [""], [0] ],
[ ['ありがとうございます'], ['ありがとうございます'], [""], [0] ],
[ ['すみません'], ['すみません'], [""], [0] ],
[ ['どういたしまして'], ['どういたしまして'], [""], [0] ],
[ [''], ['ご'], [""], [0] ],
[ [''], ['ろく'], [""], [0] ],
[ [''], ['なな','しち'], [""], [0] ],
[ [''], ['はち'], [""], [0] ],
[ [''], ['きゅう','く'], [""], [0] ],
[ [''], ['じゅう'], [""], [0] ],


[ ['end'], ['end'], ["end"], [0] ],
];
kss=77; spp=6; 
//assets.languagepod101.com/dictionary/japanese/audiomp3.php?kana=%E3%81%8C
//assets.languagepod101.com/dictionary/japanese/audiomp3.php?kana=%E3%81%99&kanji=%E5%B7%A3