kss=20; ksS=14; mms=[ [ ['#'], ['#'], ["#"], [0] ],
[ ['[','今日は'], ['こんにちは'], ["Доброго дня! Вітаю!"], [0] ],
[ ['私'], ['わたし'], ["я"], [0] ],
[ ['学生'], ['がくせい'], ["студент; слухач [курсів]; учень"], [0] ],
[ ['[','此方'], ['こちら'], ["це; ось; поруч зі мною [про людину]"], [0] ],
[ ['私達','私たち'], ['わたしたち'], ["ми"], [0] ],
[ ['卒業生'], ['そつぎょうせい'], ["випускник; людина, що закінчила навчання; людина із здобутою освітою"], [0] ],
[ ['友達','(','友だち'], ['ともだち'], ["друг; друзі"], [0] ],
[ ['[','家'], ['うち'], ["дім / сім'я"], [0] ],
[ ['東京'], ['とうきょう'], ["Токіо"], [0] ],
[ ['大学'], ['だいがく'], ["виш: університет; академія; коледж"], [0] ],
[ ['明日'], ['あした'], ["завтра; завтрашній день"], [0] ],////
[ ['行きます'], ['いきます'], ["йти; ходити / йти; їхати; відходити [звідкись]"], [0] ],////
[ ['来ます'], ['きます'], ["приходити; приїжджати; прибувати [кудись]; "], [0] ],////

[ ['乃'], ['の'], ["НО"], [0] ],
[ ['よ'], ['よ'], ["ЙО"], [0] ],
[ ['ん'], ['ん'], ["Н"], [0] ],
[ ['魔'], ['ま'], ["МА"], [0] ],
[ ['他'], ['た'], ["ТА"], [0] ],
[ ['だ'], ['だ'], ["ДА"], [0] ],






];
